org-files/Introduction_Lecture.org
#+SETUPFILE: ./org-html-themes/org/theme-bigblow.setup
#+TITLE: Seminar Data Science for Economics
#+AUTHOR: Jan
#+DATE: Dept. of Economics, Tilburg University
#+OPTIONS: toc:1 num:nil timestamp:nil

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: introduction
  :ID:       C98820D6-EBEB-41AF-8D24-8F286AE8C730
  :END:

** this lecture
   :PROPERTIES:
   :CUSTOM_ID: this-lecture
   :END:

- in this lecture, we look at:

  - motivation to learn datascience
  - first assignment

** motivation
   :PROPERTIES:
   :CUSTOM_ID: motivation
   :END:

- in this course we teach you

  - what is datascience?
  - difference with econometrics
  - prediction vs causality
  - give policy advice based on "unstructured data"
  - to use python, pymc3 and tensorflow

** things to learn
   :PROPERTIES:
   :CUSTOM_ID: examples
   :END:

- when you finish this course, you can

  - obtain data
  - clean data (in a reproducible way)
  - do data-project management
  - work with high dimensional data (tensors)
  - simulate your own estimation techniques
  - use a (simple) neural network
  - use cross validation

** finishing the course
   :PROPERTIES:
   :CUSTOM_ID: finishing-the-course
   :END:

- gives you a better understanding
  - how statistics/econometrics work
  - how to do a Bayesian analysis
  - what datascience and AI is
  - what the advantages and limits are of datascience techniques

* What do you need?
  :PROPERTIES:
  :CUSTOM_ID: what-do-you-need
  :END:

** Software
   :PROPERTIES:
   :CUSTOM_ID: install-software
   :END:

- you will be working with [[https://jupyterlab.uvt.nl/][jupyter lab]]
- if you also want to install things on your computer, use the [[https://www.anaconda.com/distribution/][anaconda distribution]]
- use github but for this you do not need to install anything

* Rules of the game
  :PROPERTIES:
  :CUSTOM_ID: rules-of-the-game
  :END:

** to learn python we use [[https://www.datacamp.com/home][datacamp]] and lectures:

  - you need to finish the datacamp courses in time
  - see the Lecture schedule for the deadlines
  - first try the notebooks yourself, then watch the video if you get stuck
  - you do not learn datascience by passively typing in answers!
  - participate actively by posting github issues for your questions
  - these will be discussed in the tutorials

** to get a grade for this seminar:

  - finish Assignment 1 before the deadline
  - Final Assignment
  - check the deadlines for the final assignment
