Introduction_Lecture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Seminar Data Science for Economics</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jan and Madina" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Seminar Data Science for Economics</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#introduction">Introduction</a></li>
<li><a href="#what-do-you-need">What do you need?</a></li>
<li><a href="#rules-of-the-game">Rules of the game</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction">Introduction</h2>
<div class="outline-text-2" id="text-introduction">
</div>

<div id="outline-container-this-lecture" class="outline-3">
<h3 id="this-lecture">this lecture</h3>
<div class="outline-text-3" id="text-this-lecture">
<ul class="org-ul">
<li>in this lecture, we look at:

<ul class="org-ul">
<li>motivation to learn datascience</li>
<li>first assignment</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-motivation" class="outline-3">
<h3 id="motivation">motivation</h3>
<div class="outline-text-3" id="text-motivation">
<ul class="org-ul">
<li>in this course we teach you

<ul class="org-ul">
<li>what is datascience?</li>
<li>difference with econometrics</li>
<li>prediction vs causality</li>
<li>give policy advice based on "unstructured data"</li>
<li>to use python, pymc3 and tensorflow</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-examples" class="outline-3">
<h3 id="examples">things to learn</h3>
<div class="outline-text-3" id="text-examples">
<ul class="org-ul">
<li>when you finish this course, you can

<ul class="org-ul">
<li>obtain data</li>
<li>clean data (in a reproducible way)</li>
<li>do data-project management</li>
<li>work with high dimensional data (tensors)</li>
<li>simulate your own estimation techniques</li>
<li>use a (simple) neural network</li>
<li>use cross validation</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-finishing-the-course" class="outline-3">
<h3 id="finishing-the-course">finishing the course</h3>
<div class="outline-text-3" id="text-finishing-the-course">
<ul class="org-ul">
<li>gives you a better understanding
<ul class="org-ul">
<li>how statistics/econometrics work</li>
<li>how to do a Bayesian analysis</li>
<li>what datascience and AI is</li>
<li>what the advantages and limits are of datascience techniques</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-what-do-you-need" class="outline-2">
<h2 id="what-do-you-need">What do you need?</h2>
<div class="outline-text-2" id="text-what-do-you-need">
</div>

<div id="outline-container-install-software" class="outline-3">
<h3 id="install-software">Software</h3>
<div class="outline-text-3" id="text-install-software">
<ul class="org-ul">
<li>you will be working with <a href="https://jupyterlab.uvt.nl/">jupyter lab</a></li>
<li>if you also want to install things on your computer, use the <a href="https://www.anaconda.com/distribution/">anaconda distribution</a></li>
<li>use github but for this you do not need to install anything</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-rules-of-the-game" class="outline-2">
<h2 id="rules-of-the-game">Rules of the game</h2>
<div class="outline-text-2" id="text-rules-of-the-game">
</div>

<div id="outline-container-org317d003" class="outline-3">
<h3 id="org317d003">to learn python we use <a href="https://www.datacamp.com/home">datacamp</a> and lectures:</h3>
<div class="outline-text-3" id="text-org317d003">
<ul class="org-ul">
<li>you need to finish the datacamp courses in time</li>
<li>see the Lecture schedule for the deadlines</li>
<li>first try the notebooks yourself, then watch the video if you get stuck</li>
<li>you do not learn datascience by passively typing in answers!</li>
<li>participate actively by posting github issues for your questions</li>
<li>these will be discussed in the tutorials</li>
</ul>
</div>
</div>

<div id="outline-container-orga089d9d" class="outline-3">
<h3 id="orga089d9d">to get a grade for this seminar:</h3>
<div class="outline-text-3" id="text-orga089d9d">
<ul class="org-ul">
<li>finish Assignment 1 before the deadline</li>
<li>Final Assignment</li>
<li>check the deadlines for the final assignment</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Dept. of Economics, Tilburg University</p>
<p class="author">Author: Jan and Madina</p>
</div>
</body>
</html>
